FirstRoutesControllers/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artworks" SET "image_url" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["image_url", "hello world"], ["updated_at", "2023-02-16 21:28:10.497041"], ["id", 1]]
---
    def update
      @artwork = Artwork.find(params[:id])

      if @artwork.update(artwork_params)

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 4]]
---
    def destroy
      @artwork = Artwork.find(params[:id])
      if @artwork.destroy #delete vs destroy - destroy removes dependent whereas delete only that row