FirstRoutesControllers/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Steve"], ["email", "ertrr@gmail.com"], ["updated_at", "2023-02-16 16:05:12.059806"], ["id", 4]]
---
    def update
      @user = User.find(params[:id])

      if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]
---
    def destroy
      @user = User.find(params[:id])
      if @user.destroy #delete vs destroy - destroy removes dependent whereas delete only that row